In [1]:
import sqlite3
import pandas as pd
import numpy as np

In [2]:
con = sqlite3.connect('test_matches.db')

In [3]:
df_matches =  pd.read_sql_query("SELECT * FROM match", con)

In [4]:
df_matches.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 100 entries, 0 to 99
Data columns (total 6 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   id         100 non-null    int64
 1   game_id    100 non-null    object
 2   team_1     100 non-null    object
 3   team_2     100 non-null    object
 4   gold_diff  100 non-null    object
 5   winner     100 non-null    object
dtypes: int64(1), object(5)
memory usage: 4.8+ KB

In [5]:
df_matches.sample(5)

,id,game_id,team_1,team_2,gold_diff,winner
92,93,NA1_4095222204,"[2500, 2500, 2913, 4216, 6154, 7860, 10451, 11...","[2500, 2500, 2864, 4416, 5650, 7279, 9634, 108...",[ 0 0 49 -200 504 581 817 703 965 ...,Team 2
26,27,NA1_4097599833,"[2500, 2500, 3097, 4638, 6578, 8594, 9692, 110...","[2500, 2500, 3395, 4949, 6197, 8474, 10703, 12...",[ 0 0 -298 -311 381 120 -1011 -11...,Team 2
85,86,NA1_4096239933,"[2500, 3000, 3401, 4848, 7938, 9252, 10904, 12...","[2500, 2500, 2971, 5024, 6224, 7718, 9346, 106...",[ 0 500 430 -176 1714 1534 1558 18...,Team 2
96,97,NA1_4094111987,"[2500, 2500, 2872, 4348, 5841, 6945, 8285, 992...","[2500, 2500, 2934, 4567, 5889, 7399, 9709, 112...",[ 0 0 -62 -219 -48 -454 -1...,Team 1
97,98,NA1_4094054225,"[2500, 2500, 2929, 4688, 6242, 7959, 9310, 111...","[2500, 2500, 2910, 4920, 6021, 7489, 9141, 106...",[ 0 0 19 -232 221 470 169 4...,Team 2

In [6]:
df_matches.drop_duplicates(subset=['game_id'])

,id,game_id,team_1,team_2,gold_diff,winner
0,1,NA1_4155081821,"[2500, 2500, 3076, 4705, 5845, 7620, 8865, 101...","[2500, 2500, 2945, 4917, 6725, 8345, 9748, 124...",[ 0 0 131 -212 -880 -725 -...,Team 1
1,2,NA1_4148645836,"[2500, 2500, 2649, 3913, 5486, 6865, 8187, 988...","[2500, 3020, 3127, 5605, 6767, 9455, 10660, 12...",[ 0 -520 -478 -1692 -1281 -2590 -2...,Team 1
2,3,NA1_4147765789,"[2500, 2500, 2907, 4267, 6494, 8279, 10132, 12...","[2500, 2500, 2882, 4661, 5754, 7462, 9607, 113...",[ 0 0 25 -394 740 817 525 8...,Team 2
3,4,NA1_4146420670,"[2500, 2500, 2914, 4279, 5677, 7711, 9627, 111...","[2500, 2500, 2917, 4243, 6373, 7909, 9537, 126...",[ 0 0 -3 36 -696 -198 ...,Team 1
4,5,NA1_4146375941,"[2500, 2500, 2881, 5599, 6848, 8233, 9455, 115...","[2500, 2520, 2859, 4610, 6144, 7885, 9728, 110...",[ 0 -20 22 989 704 348 -273 5...,Team 1
...,...,...,...,...,...,...
95,96,NA1_4095051926,"[2500, 2500, 2678, 4209, 5536, 6970, 8528, 110...","[2500, 2500, 3609, 4929, 6573, 8979, 10378, 12...",[ 0 0 -931 -720 -1037 -2009 -1850 -14...,Team 1
96,97,NA1_4094111987,"[2500, 2500, 2872, 4348, 5841, 6945, 8285, 992...","[2500, 2500, 2934, 4567, 5889, 7399, 9709, 112...",[ 0 0 -62 -219 -48 -454 -1...,Team 1
97,98,NA1_4094054225,"[2500, 2500, 2929, 4688, 6242, 7959, 9310, 111...","[2500, 2500, 2910, 4920, 6021, 7489, 9141, 106...",[ 0 0 19 -232 221 470 169 4...,Team 2
98,99,NA1_4094030126,"[2500, 2500, 2784, 4680, 6388, 7639, 9333, 108...","[2500, 2500, 2889, 4552, 6136, 7754, 9710, 114...",[ 0 0 -105 128 252 -115 -377 -6...,Team 1
99,100,NA1_4093981884,"[2500, 2500, 2907, 4613, 6039, 7671, 9491, 112...","[2500, 2500, 2670, 4250, 5864, 7239, 8754, 102...",[ 0 0 237 363 175 432 737 1029 2606 ...,Team 2

In [7]:
df_data = df_matches[["gold_diff", "winner"]]

In [8]:
df_data.head()

                                           gold_diff  winner
0  [     0      0    131   -212   -880   -725   -...  Team 1
1  [     0   -520   -478  -1692  -1281  -2590  -2...  Team 1
2  [    0     0    25  -394   740   817   525   8...  Team 2
3  [     0      0     -3     36   -696   -198    ...  Team 1
4  [    0   -20    22   989   704   348  -273   5...  Team 1

In [9]:
sample_1 = df_data["gold_diff"][0]
sample_1

'[     0      0    131   -212   -880   -725   -883  -2318  -2211  -1017\n  -1586  -2281  -2990  -3286  -2207  -2622  -2795  -3527  -5095  -5702\n  -5734  -5234  -7537  -9842 -11129 -15150 -15794 -18278]'

In [10]:
sample_1 = sample_1.strip(" []\n")

In [11]:
test = str(sample_1)
test

'0      0    131   -212   -880   -725   -883  -2318  -2211  -1017\n  -1586  -2281  -2990  -3286  -2207  -2622  -2795  -3527  -5095  -5702\n  -5734  -5234  -7537  -9842 -11129 -15150 -15794 -18278'

In [12]:
test  = test.strip("[]")
test = test.strip()
test

'0      0    131   -212   -880   -725   -883  -2318  -2211  -1017\n  -1586  -2281  -2990  -3286  -2207  -2622  -2795  -3527  -5095  -5702\n  -5734  -5234  -7537  -9842 -11129 -15150 -15794 -18278'

In [43]:
test_1 = df_matches["team_1"][0]
# test_2 = [int(num) for num in test_1]

In [62]:
# test_3 = 
# for item in test_1:
#     print(item).type
# # arr = test_1
# # arr
gold_regex_1 = test_1.strip("[]'").strip(" '' ").split(", ")
gold_reg_mod = [int(item) for item in test_1.strip("[]'").strip(" '' ").split(", ")]
gold_reg_mod

[2500,
 2500,
 3076,
 4705,
 5845,
 7620,
 8865,
 10102,
 12133,
 15487,
 16799,
 19575,
 21502,
 22695,
 25062,
 26646,
 29657,
 31571,
 33253,
 35524,
 37121,
 39958,
 41876,
 44169,
 45370,
 47336,
 49782,
 50232]

In [83]:
change_to_arr = lambda x: np.array([int(item) for item in x.strip("[]'").strip(" '' ").split(", ")])

In [94]:
df_gold = df_matches[["team_1", "team_2", "winner"]] 
df_gold["team_1"] = df_gold.team_1.apply(change_to_arr)
df_gold["team_2"] = df_gold.team_2.apply(change_to_arr)
df_gold["diff"] = df_gold["team_1"] - df_gold["team_2"]

data = df_gold[["diff", "winner"]]
data

D:\anaconda\envs\py37gpu\lib\site-packages\ipykernel_launcher.py:2: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy

D:\anaconda\envs\py37gpu\lib\site-packages\ipykernel_launcher.py:3: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  This is separate from the ipykernel package so we can avoid doing imports until
D:\anaconda\envs\py37gpu\lib\site-packages\ipykernel_launcher.py:4: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  after removing the cwd from sys.path.

                                                 diff  winner
0   [0, 0, 131, -212, -880, -725, -883, -2318, -22...  Team 1
1   [0, -520, -478, -1692, -1281, -2590, -2473, -3...  Team 1
2   [0, 0, 25, -394, 740, 817, 525, 862, 1473, 269...  Team 2
3   [0, 0, -3, 36, -696, -198, 90, -1495, -2016, -...  Team 1
4   [0, -20, 22, 989, 704, 348, -273, 523, 1180, 9...  Team 1
..                                                ...     ...
95  [0, 0, -931, -720, -1037, -2009, -1850, -1433,...  Team 1
96  [0, 0, -62, -219, -48, -454, -1424, -1373, -80...  Team 1
97  [0, 0, 19, -232, 221, 470, 169, 463, 873, 846,...  Team 2
98  [0, 0, -105, 128, 252, -115, -377, -687, -610,...  Team 1
99  [0, 0, 237, 363, 175, 432, 737, 1029, 2606, 29...  Team 2

[100 rows x 2 columns]